from config import *

start_text = "Привет! Я посчитаю норму ваших калорий в день. Выберите опцию."
info_text = "Вас приветствует бот, с моей помощью вы можете купить витамины а также рассчитать норму калорий"
calc_text = "Выберите опцию:"
reg_text = "Введите имя пользователя (только латинский алфавит):"
calc_formula = """Формула Миффлина-Сан Жеора:
Для мужчин: BMR = 10 * вес(кг) + 6.25 * рост(см) - 5 * возраст(лет) + 5
Для женщин: BMR = 10 * вес(кг) + 6.25 * рост(см) - 5 * возраст(лет) - 161"""
